const defaultMessage = ' Using word of the day instead.'

export function getWordOfTheDay() {
  if (location.search) {
    try {
      const query = atob(location.search.slice(1))
      if (query.length !== 5) {
        alert(`Incorrect word length from encoded query. ${defaultMessage}`)
      } else {
        return query.toLowerCase();
      }
    } catch (e) {
      alert(`Malformed encoded word query. ${defaultMessage}`)
    }
  }

  const now = new Date()
  const start = new Date(2022, 0, 0)
  const diff = Number(now) - Number(start)
  let day = Math.floor(diff / (1000 * 60 * 60 * 24))
  day = day % answers.length
  return answers[day]
}

// https://azbyka.ru/shemy/imena-biblejskie.shtml
// https://ru.wikinews.org/wiki/%D0%9A%D0%B0%D1%82%D0%B5%D0%B3%D0%BE%D1%80%D0%B8%D1%8F:%D0%91%D0%B8%D0%B1%D0%BB%D0%B5%D0%B9%D1%81%D0%BA%D0%B8%D0%B5_%D0%B8%D0%BC%D0%B5%D0%BD%D0%B0_%D0%BF%D0%BE_%D0%B0%D0%BB%D1%84%D0%B0%D0%B2%D0%B8%D1%82%D1%83
// https://ru.wikipedia.org/wiki/%D0%91%D0%B8%D0%B1%D0%BB%D0%B5%D0%B9%D1%81%D0%BA%D0%B8%D0%B5_%D0%B8%D0%BC%D0%B5%D0%BD%D0%B0

const answers = [
  'симон',
  'давид',
  'павел',
  'аарон',
  'иавал',
  'агарь',
  'иисус',
  'ефрем',
  'иаиль',
  'михей',
  'нахор',
  'ноема',
  'наама',
  'садок',
  'марфа',
  'милка',
  'нафан',
  'зелфа',
  'рувим',
  'молох',
  'зилот',
  'аггей',
  'сарра',
  'иаков',
  'емима', //Старшая дочь Иова (Иов 42:14).
  'ездра',
  'авдий',
  'мария',
  'варак',
  'димас', //Один из помощ­ни­ков апо­сто­ла Павла, впо­след­ствии оста­вив­ший его. (Кол 4:14; 2Тим 4:10; Флм 1:23)
  'пилат',
  'варух',
  'аммон',
  'авель',
  'валла', // Рабыня Рахили, кото­рую хозяй­ка, отда­ла в налож­ни­цы сво­е­му мужу Иакову. В резуль­та­те это­го роди­лись Дан и Неффа­лим. (Быт 30:1-8)
  'акила',
  'ванея',
  'иофам',
  'иофор', //Мадиам­ский свя­щен­ник, отец Сепфо­ры, тесть Моисея. В Исх 2:18
  'иорам',
  'ахаик',
  'апфия',
  'лоида', //Бабка Тимофея, хри­сти­ан­ка, о кото­рой с похва­лой отзы­ва­ет­ся Павел. (2Тим 1:5)
  'иоиль',
  'лаван',
  'левий',
  'ламех',
  'исаия',
  'исаак',
  'фарес',
  'фарра',
  'халев',
  'тихик',
  'сихем',
  'иосиф',
  'крисп', //Апостол от семи­де­ся­ти, уче­ник апо­сто­ла Павла. (Деян 18:8; 1Кор 1:14)
  'иувал', //Сын Ламеха (Быт 4:21)
  'аврам',
  'амрам',
  'иафет', //Сын Ноя
  'алфей',
  'иcаак',
  'иасон', //Фесса­ло­ни­ки­ец, при­ни­мав­ший у себя в доме Павла и Силу
  'иоанн',
  'амнон',
  'иоиль',
  'иавис',
  'иаред',
  'иосия',
  'ионав', // (4 Царств 10:15) – сын Рехава.
  'авиуд', // (1 Паралипоменон 3:10) - из родословия Давида.
  'тимон', // Апостол от семи­де­ся­ти, один из слу­жи­те­лей церк­ви в Иеруса­ли­ме. (Деян 6:5)
  'тихик', // Апостол от семи­де­ся­ти, спо­движ­ник апо­сто­ла Павла. (Деян 20:4; Еф 6:21; Кол 4:7; 2Тим 4:12; Тит 3:12)
  'фарес'  // Сын Иуды (1) и Фамари, брат-близ­нец Зары. (Быт 38:28-29).
]

const allowedGuesses = [
  'Силом',
  'Фирца',
  'Хирам',
  'Цилла',
  'Эраст'
]


export const allWords = [...answers, ...allowedGuesses]
